# -*- coding: utf-8 -*-

# Есть словарь кодов товаров



# Рассчитать на какую сумму лежит каждого товара на складе.
#
# Вывести суммарную стоимость каждого товара на складе c помощью циклов
# То есть: всего по лампам, стульям, етс.
# Формат строки вывода: "<товар> - <кол-во> шт, стоимость <общая стоимость> руб"
#
# Алгоритм должен получиться приблизительно такой:
#
# цикл for по товарам с получением кода и названия товара
#     инициализация переменных для подсчета количества и стоимости товара
#     получение списка на складе по коду товара
#     цикл for по списку на складе
#         подсчет количества товара
#         подсчет стоимости товара
#     вывод на консоль количества и стоимости товара на складе

goods = {
    'Лампа': '12345',
    'Стол': '23456',
    'Диван': '34567',
    'Стул': '45678',
}

# Есть словарь списков количества товаров на складе.

store = {
    '12345': [
        {'quantity': 27, 'price': 42},
    ],
    '23456': [
        {'quantity': 22, 'price': 510},
        {'quantity': 32, 'price': 520},
    ],
    '34567': [
        {'quantity': 2, 'price': 1200},
        {'quantity': 1, 'price': 1150},
    ],
    '45678': [
        {'quantity': 50, 'price': 100},
        {'quantity': 12, 'price': 95},
        {'quantity': 43, 'price': 97},
        {'quantity': 1, 'price': 100},
    ],
}

for good, item in goods.items():
    print(good)
    quantity_goods = 0
    price = 0
    item_amount = 0
    all_goods = 0
    all_sum = 0
    for quantity in store[item]:
        quantity_goods = quantity['quantity']
        price = quantity['price']
        item_amount = quantity_goods * price
        all_goods += quantity['quantity']
        all_sum += item_amount
    print('Количество товара ', all_goods, 'Сумма товара ', all_sum)
